app/Controllers/CategoriasController.php

SELECT *
FROM `cat_productos`
SELECT *
FROM `productos`
---
    public function verCategorias()
    {
        $categoria = new CategoriasModel();
        $producto = new ProductosModel();
        $datos['productos'] = $producto->findAll();

SELECT *
FROM `productos`
WHERE `producto_id` = '105'
 LIMIT 1
---
    public function buscar($id)
    {
        //echo $id;

        $producto = new ProductosModel();

        $datos['datos'] = $producto->where(['producto_id' => $id])->first();