app/Controllers/HomeController.php

    public function index()
    {
        $producto = new ProductosModel();
        $categoria = new CategoriasModel();
        $datos['categorias'] = $categoria->findAll();
        $datos['productos'] = $producto->findAll();
---
SELECT *
FROM `cat_productos`
SELECT *
FROM `productos`