app/Controllers/MarcaController.php

SELECT *
FROM `marcas`
---
    public function verMarcas()
    {
        $marcas = new MarcasModel();
        $datos['marcas'] = $marcas->findAll();

SELECT *
FROM `marcas`
---
     public function index()
    {
        $marcas = new MarcasModel();
        $datos['datos'] = $marcas->findAll();