app/Controllers/ProductoController.php

    public function verProductos()
    {
        $categoria = new CategoriasModel();
        $datos['categorias'] = $categoria->findAll();
        $producto = new ProductosModel();
        $datos['productos'] = $producto->findAll();
---
SELECT *
FROM `cat_productos`
SELECT *
FROM `productos`

    public function buscar($producto_id)
    {
        $producto = new ProductosModel();
        $datos['datos'] = $producto->where('producto_id', $producto_id)->first();
---
SELECT *
FROM `productos`
WHERE `producto_id` = '112'
 LIMIT 1